Repository: theofournier/my-ids
Catalog: lib/l10n/intl_*.arb
Languages: fr

# appTitle
source: My IDs
fr: Mes IDs

# homeTitle
source: Welcome on My IDs
fr: Bienvenue sur Mes IDs

# bottomBarProfile
source: Profile
fr: Profil

# searchId
source: Search an ID
fr: Rechercher un ID

source: Profile
fr: Profil

source: Settings
fr: Paramètres

source: Edit ID
fr: Modifier ID

source: Copied!
fr: Copié !

source: New ID
fr: Nouvel ID

source: Title
fr: Titre

source: Name
fr: Nom

source: Password
fr: Mot de passe

source: Color
fr: Couleur

source: No color
fr: Sans couleur

source: Cancel
fr: Annuler

source: Save
fr: Sauvegarder

source: Delete
fr: Supprimer

source: Yes
fr: Oui

source: No
fr: Non

source: Undo
fr: Annuler

source: Add ID item
fr: Ajouter un ID

# removeIdConfirmation
source: Do you want remove this ID?
fr: Voulez-vous vraiment supprimer cet ID?

source: ID removed
fr: ID supprimé

# noIdFound
source: No ID founded
fr: Aucun ID trouvé

# noId
source: No ID added yet
fr: Aucun ID encore ajouté

source: Created
fr: Créé

source: Updated
fr: Mise à jour

source: is required
fr: est requis

source: ID added!
fr: ID ajouté !

source: ID updated!
fr: ID mise à jour !

source: ID deleted!
fr: ID supprimé !

source: Welcome on
fr: Bienvenue sur

# firstEnterMasterCode
source: First, enter your master code
fr: Premièrement, entrez un code maître

# warningMasterCode
source: You can't retrieve it, so don't forget it
fr: Vous ne pouvez pas le récupérer, alors ne l'oubliez pas

# setMasterCode
source: Set a master code of 4 to 8 digits
fr: Entrez un code maître de 4 à 8 chiffres

source: Confirm master code
fr: Confirmez code maître

source: Next
fr: Suivant

source: Previous
fr: Précédent

# errorMasterCodeWrong
source: Wrong master code
fr: Mauvais code maître

# errorMasterCodeInvalid
source: Master code must be 4 to 8 digits
fr: Code maître doit être de 4 à 8 chiffres

# errorMasterCodeConfirmation
source: Master code not identical
fr: Codes maître non identique

source: Master code saved
fr: Code maître sauvegardé

# biometricsRequestTitle
source: You can also connect with your biometrics data
fr: Vous pouvez aussi vous connecter avec vos données biometriques

# biometricsRequestDialog
source: Scan your biometric to authenticate
fr: Scannez votre biometrique pour vous authentifiez

source: Accept
fr: Accepter

source: Skip
fr: Passer

# biometricsLater
source: You can add biometric authentication later in the profile
fr: Vous pouvez ajouter l'authentification par biometrique plus tard dans le profil

# errorBiometricsAuthentication
source: Impossible to connect you with biometric data
fr: Impossible de vous connecter avec vos données biometriques

# errorBiometricsUnavailable
source: Biometric unavailable
fr: Biométrique non disponible

# profileBiometricSwitch
source: Biometric enable
fr: Biometrique activé

source: Update master code
fr: Modifier code maître

# updateMasterCodeSuccessTitle
source: Master code updated
fr: Code maître mise à jour

# updateMasterCodeSuccessMessage
source: Your master code has been updated successfully.
fr: Votre code maître a été mise à jours avec succés.

source: Current master code
fr: Code maître actuel

source: New master code
fr: Nouveau code maître

# updateMasterCodeErrorTitle
source: Wrong current master code
fr: Mauvais actuel code maître
